---
kind: type
id: T:Autodesk.Revit.DB.FamilyInstance
zh: 族实例
source: html/0d2231f8-91e6-794f-92ae-16aad8014b27.htm
---
# Autodesk.Revit.DB.FamilyInstance

**中文**: 族实例

This object represents a single instance of a family type, such as a single I beam.

## Syntax (C#)
```csharp
public class FamilyInstance : Instance
```

## Remarks
Examples of FamilyInstance objects within Autodesk Revit are Beams, Columns,
 Braces and Desks. The FamilyInstance object provides more detailed properties that
 enable the type of the family instance to be changed, thus changing their appearance
 within the project.